//-------------------------------------------------------------------------------
//                                                                               
//    This code was automatically generated.                                     
//    Changes to this file may cause incorrect behavior and will be lost if      
//    the code is regenerated.                                                   
//                                                                               
//-------------------------------------------------------------------------------

namespace EditorDatabase.Enums
{
	public enum ItemType
	{
		未定义 = 0,
		组件 = 1,
		设备 = 2,
		武器 = 3,
		旧弹头 = 4,
		无人机坪 = 5,
		飞船 = 6,
		僚机 = 7,
		飞船配置 = 8,
		僚机配置 = 9,
		科技 = 10,
		组件属性 = 11,
		组件附加属性 = 12,
		技能 = 13,
		势力 = 14,
		任务 = 15,
		物品列表 = 16,
		舰队 = 18,
		角色 = 19,
		任务物品 = 20,
		弹头 = 25,
		视觉效果 = 26,
		子弹模板 = 27,
		飞船设置 = 100,
		全局设置 = 101,
		数据库设置 = 102,
		探索设置 = 103,
	}
}
