//-------------------------------------------------------------------------------
//                                                                               
//    This code was automatically generated.                                     
//    Changes to this file may cause incorrect behavior and will be lost if      
//    the code is regenerated.                                                   
//                                                                               
//-------------------------------------------------------------------------------

namespace EditorDatabase.Enums
{
	public enum NodeType
	{
		未定义 = 0,
		即将到来 = 1,
		显示对话 = 10,
		打开船坞 = 11,
		条件 = 15,
		随机 = 16,
		状态 = 17,
		攻击舰队 = 20,
		攻击星系敌人 = 21,
		摧毁星系敌人 = 25,
		压制星系敌人 = 26,
		撤退 = 30,
		接收物品 = 35,
		移除物品 = 36,
		交易 = 37,
		完成任务 = 40,
		失败任务 = 41,
		取消任务 = 42,
		开始任务 = 43,
		设置角色好感 = 50,
		设置势力声望 = 51,
		更改角色好感 = 55,
		更改势力声望 = 56,
		占领空间站 = 60,
		解放空间站 = 61,
		更改星区势力 = 62,
	}
}
